## Part 1: Explore the Data

Import the data and use Pandas to learn more about the dataset.

In [1]:
import pandas as pd

df = pd.read_csv('Resources/client_dataset.csv')
df.head()

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,item_id,category,subcategory,unit_price,unit_cost,unit_weight,qty,line_number
0,Donald,Harding,Immunologist,793-904-7725x39308,harding.donald.7185@sullivan.com,58515,8953482,2023-04-28,17,2023,EUD29711-63-6U,decor,wall art,1096.80,762.71,7.50,105,1
1,Tiffany,Myers,Music therapist,201.442.4543x942,myers.t.6537@ferguson-johnson.net,37609,8069089,2023-05-19,20,2023,XDA18116-89-4A,consumables,pens,24.95,15.09,1.49,21,0
2,Shannon,Watson,Immunologist,687.737.9424x8503,swatson8146@payne.net,57113,1902144,2023-01-29,4,2023,ABE59463-05-7E,software,project management,13.52,7.86,1.68,39,6
3,Nathan,Baker,Accounting technician,827-788-8123x012,bakernathan@benson.com,46554,9031802,2023-04-25,17,2023,ZMM00836-65-0C,consumables,pens,36.42,24.85,1.23,29,3
4,Christina,Schwartz,Chiropractor,265-829-3643,christinaschwartz9252@mcconnell.com,92089,1322274,2023-05-28,21,2023,BZX55559-12-3X,consumables,misc,195.10,108.17,46.43,20,1

In [2]:
# View the column names in the data
df.columns

Index(['first', 'last', 'job', 'phone', 'email', 'client_id', 'order_id',
       'order_date', 'order_week', 'order_year', 'item_id', 'category',
       'subcategory', 'unit_price', 'unit_cost', 'unit_weight', 'qty',
       'line_number'],
      dtype='object')

In [3]:
# Use the describe function to gather some basic statistics
df.describe()

,client_id,order_id,order_week,order_year,unit_price,unit_cost,unit_weight,qty,line_number
count,54639.000000,5.463900e+04,54639.000000,54639.000000,54639.000000,54639.000000,54639.000000,5.463900e+04,54639.000000
mean,54837.869416,5.470190e+06,11.359139,2022.993064,136.267207,99.446073,5.004116,5.702646e+02,2.979667
std,25487.438231,2.599807e+06,7.023499,0.082997,183.873135,133.164267,5.326599,1.879552e+04,2.436320
min,10033.000000,1.000886e+06,1.000000,2022.000000,0.010000,0.010000,0.000000,0.000000e+00,0.000000
25%,33593.000000,3.196372e+06,6.000000,2023.000000,20.800000,14.840000,1.450000,3.200000e+01,1.000000
50%,53305.000000,5.496966e+06,11.000000,2023.000000,68.310000,49.890000,3.240000,6.800000e+01,3.000000
75%,78498.000000,7.733869e+06,17.000000,2023.000000,173.160000,125.570000,6.890000,1.700000e+02,5.000000
max,99984.000000,9.998480e+06,52.000000,2023.000000,1396.230000,846.270000,46.430000,3.958244e+06,9.000000

In [4]:
# Use this space to do any additional research
# and familiarize yourself with the data.
df.count()

first          54639
last           54639
job            54639
phone          54639
email          54639
client_id      54639
order_id       54639
order_date     54639
order_week     54639
order_year     54639
item_id        54639
category       54639
subcategory    54639
unit_price     54639
unit_cost      54639
unit_weight    54639
qty            54639
line_number    54639
dtype: int64

In [5]:
# What three item categories had the most entries?
top_3_categories = df["category"].value_counts()
top_3_categories.head(3)
# Answer. The three categories with the most entries: consumables, furniture and software.

category
consumables    23538
furniture      11915
software        8400
Name: count, dtype: int64

In [6]:
# For the category with the most entries, which subcategory had the most entries?
top_category = df[df["category"] == "consumables"]
top_subcategory = top_category["subcategory"].value_counts()
top_subcategory.head()
# Answer. The category with the most entries is consumables.
# Within consumables, the subcategory with the most entries is bathroom supplies.

subcategory
bathroom supplies    6424
paper products       5874
kitchen supplies     5746
misc                 2891
pens                 2603
Name: count, dtype: int64

In [7]:
# Which five clients had the most entries in the data?
df["client_id"].value_counts().head(5)
# Answer. The five clients with the most entries are client_id: 33615, 66037, 46820,
# 38378 and 24741.

client_id
33615    220
66037    211
46820    209
38378    207
24741    207
Name: count, dtype: int64

In [8]:
# Store the client ids of those top 5 clients in a list.
top_5clients_entry = df["client_id"].value_counts().head(5)
top_5clients_ids = top_5clients_entry.index.tolist()
top_5clients_ids

[33615, 66037, 46820, 38378, 24741]

In [9]:
# How many total units (the qty column) did the client with the most entries order order?
client_most_entries = top_5clients_ids[0]
df[df["client_id"] == client_most_entries]["qty"].sum()
# Answer. The client with the most entries is client_id: 33615.
# He had 64,313 units ordered.

64313

## Part 2: Transform the Data
Do we know that this client spent the more money than client 66037? If not, how would we find out? Transform the data using the steps below to prepare it for analysis.

In [10]:
# Create a column that calculates the subtotal for each line using the unit_price and the qty
df["subtotal"] = df["unit_price"] * df["qty"]
df["subtotal"]

0        115164.00
1           523.95
2           527.28
3          1056.18
4          3902.00
           ...
54634      2743.29
54635      9709.73
54636     31188.50
54637       165.76
54638      3103.31
Name: subtotal, Length: 54639, dtype: float64

In [11]:
# Create a column for shipping price.
# Assume a shipping price of $7 per pound for orders over 50 pounds and $10 per pound for items 50 pounds or under.
def shipping(row):
    if row["unit_weight"] * row["qty"] > 50:
        shipping_price = 7 * row["unit_weight"] * row["qty"]
        return shipping_price
    else:
        shipping_price = 10 * row["unit_weight"] * row["qty"]
        return shipping_price

df["shipping_price"] = df.apply(shipping, axis = 1) 

df["shipping_price"]

0         5512.50
1          312.90
2          458.64
3          356.70
4         6500.20
           ...
54634      519.75
54635     3849.30
54636    13832.00
54637    14143.36
54638    14939.19
Name: shipping_price, Length: 54639, dtype: float64

In [12]:
# Create a column for the total price using the subtotal and the shipping price along with a sales tax of 9.25%
# Answer assumes 9.25% tax rate also applied to shipping price.
def price_total(row):
    total_price = 1.0925 * ( row["subtotal"] + row["shipping_price"] )
    return total_price

df["total_price"] = df.apply(price_total, axis = 1)

df["total_price"]

0        131839.076250
1           914.258625
2          1077.117600
3          1543.571400
4         11364.403500
             ...
54634      3564.871200
54635     14813.240275
54636     49184.896250
54637     15632.713600
54638     19711.431250
Name: total_price, Length: 54639, dtype: float64

In [13]:
# Create a column for the cost of each line using unit cost, qty, and
# shipping price (assume the shipping cost is exactly what is charged to the client).

def cost_total(row):
    total_cost = row["unit_cost"] * row["qty"] + row["shipping_price"]
    return total_cost

df["total_cost"] = df.apply(cost_total, axis = 1)

df["total_cost"]

0        85597.05
1          629.79
2          765.18
3         1077.35
4         8663.60
           ...
54634     2222.55
54635    12095.92
54636    41054.25
54637    14280.00
54638    16599.10
Name: total_cost, Length: 54639, dtype: float64

In [14]:
# Create a column for the profit of each line using line cost and line price

df["total_profit"] = df["total_price"] - df["total_cost"]

df["total_profit"]

0        46242.026250
1          284.468625
2          311.937600
3          466.221400
4         2700.803500
             ...
54634     1342.321200
54635     2717.320275
54636     8130.646250
54637     1352.713600
54638     3112.331250
Name: total_profit, Length: 54639, dtype: float64

## Part 3: Confirm your work
You have email receipts showing that the total prices for 3 orders. Confirm that your calculations match the receipts. Remember, each order has multiple lines.

Order ID 2742071 had a total price of \$152,811.89

Order ID 2173913 had a total price of \$162,388.71

Order ID 6128929 had a total price of \$923,441.25

In [15]:
# Check your work using the totals above

df["total_price"].loc[ df["order_id"] == 2742071 ].sum()

152811.897075

In [16]:
df["total_price"].loc[ df["order_id"] == 2173913 ].sum()

162388.7193

In [17]:
df["total_price"].loc[ df["order_id"] == 6128929 ].sum()

923441.24045

## Part 4: Summarize and Analyze
Use the new columns with confirmed values to find the following information.

In [18]:
# How much did each of the top 5 clients by quantity spend? Check your work from Part 1 for client ids.
def spend_total(clients):
    for client in clients:
        total_spend = df["total_price"].loc[ df["client_id"] == client ].sum()
        print(total_spend)

spend_total(top_5clients_ids)

8377308.572500001
10259514.801275
9743794.320474999
12906550.880874999
82268891.97985002

In [19]:
# Check for client_id 33615 and total_price
df["total_price"].loc[ df["client_id"] == 33615 ].sum()

8377308.572500001

In [20]:
# Create a summary DataFrame showing the totals for the for the top 5 clients with the following information:
# total units purchased, total shipping price, total revenue, and total profit. 

clean_df = df[["client_id", "qty", "shipping_price", "total_price", "total_profit"]].copy()
filter_df = clean_df[df["client_id"].isin(top_5clients_ids)]
combine_df = filter_df.groupby("client_id").agg({
            "qty": "sum",
            "shipping_price": "sum",
            "total_price": "sum",
            "total_profit": "sum"
            })

combine_df

              qty  shipping_price   total_price  total_profit
client_id
24741      239862      5126448.37  8.226889e+07  3.657999e+07
33615       64313      1828984.89  8.377309e+06  2.201995e+06
38378       73667      3429455.40  1.290655e+07  3.271830e+06
46820       75768      1601448.84  9.743794e+06  2.736603e+06
66037       43018      1395151.85  1.025951e+07  3.255032e+06

In [21]:
# Format the data and rename the columns to names suitable for presentation.
# Define the money columns. 

# Define a function that converts a dollar amount to millions.
def currency_format_millions(amount):
    return round(amount / 1000000, 3)

# Apply the currency_format_millions function to only the money columns. 
money_columns = ["shipping_price", "total_price", "total_profit"]

combine_df[money_columns] = combine_df[money_columns].apply(currency_format_millions)

# Rename the columns to reflect the change in the money format. 
combine_df = combine_df.rename(columns = {
    "client_id": "Client ID",
    "qty": "Quantity",
    "shipping_price": "Shipping Price ($mil)",
    "total_price": "Revenues ($mil)",
    "total_profit": "Total Profit ($mil)"
})
# Format Quantity to ,000 
combine_df["Quantity"] = combine_df["Quantity"].apply(lambda x: f"{x:,}")

combine_df

,Quantity,Shipping Price ($mil),Revenues ($mil),Total Profit ($mil)
client_id,,,,
24741,"239,862",5.126,82.269,36.580
33615,"64,313",1.829,8.377,2.202
38378,"73,667",3.429,12.907,3.272
46820,"75,768",1.601,9.744,2.737
66037,"43,018",1.395,10.260,3.255

In [22]:
# Sort the updated data by "Total Profit (millions)" form highest to lowest and assign the sort to a new DatFrame.
sorted_df = combine_df.sort_values(by = "Total Profit ($mil)", ascending = False)
sorted_df

,Quantity,Shipping Price ($mil),Revenues ($mil),Total Profit ($mil)
client_id,,,,
24741,"239,862",5.126,82.269,36.580
38378,"73,667",3.429,12.907,3.272
66037,"43,018",1.395,10.260,3.255
46820,"75,768",1.601,9.744,2.737
33615,"64,313",1.829,8.377,2.202

## Summary

* These are the top 5 clients by number of orders.
* Each customer has a unique Client ID.
* The top 5 clients are sorted by Total Profit in a descending order.  For example,
  client_id 24741 generated $36.58 million in total profits during the year 2023.
* It is no surprise that this same client also generated the most quantity ordered,
  shipping price and revenues.
* The results for the four other customers are more similar, measured by the four
  criterias.